"""მოხმარებელს შემოატანინეთ რიცხვი, შემდეგ კი დაუბეჭდეთ ეს რიცხვი დადებითია, უარყოფითი თუ ნეიტურალი ანუ ნული. შემდეგ კომენტარებით ახსენით რა გასნხვავებაა if-სა და elif-ს შორის რატომ არ შეიძლება ზოგერ elif-ს ნაცვლად if-ის გამოყენება"""

num = int(input("enter any number:"))
if num > 0:
    print("the number is positive")
elif num < 0:
    print("the number is negative")
else:
    print("the number is zero")

#elif - ციკლი გამოიყენება იმ შემთხვევაში თუ გვაქვს რამდენიმე პირობა, რომელიც უნდა შევამოწმოთ.
# if - ციკლი გამოიყენება მხოლოდ ერთ პირობასთან სამუშაოდ.

