'''შექმენით 5 ცვლადი, რომლებშიც შეინახავთ განსხვავებულ შედარების ოპერაციათა შედეგებს, შედარების ოპერაციას გვერდზე კომენტარის საშვალებით მიუწერეთ მისი შედეგი (boolean მნიშვნელობა) და ახსენით რა განსხვავებაა ოპერატორსა და ოპერაციას შორის'''
 
eq1 = 4 > 1 # True
eq2 = 4 <= 1 # False
eq3 = 4 == 1 # False
eq4 = 4 != 1 # True
eq5 = 4 >=1 # True

# ოპერატორისა და ოპერაციის განსხვავება:
# ოპერატორი არის სიმბოლო ან სიმბოლოთა ნაკრები, რომელიც განსაზღვრავს მოქმედებას (მაგ: >, <, ==, !=).
# ოპერაცია არის კონკრეტული მოქმედება, რომელიც შესრულებულია ოპერატორის გამოყენებით (მაგ: 5 > 3).
