'''2) განმარტეთ control flow, ჩამოწერეთ მისი შემადგენელი ტექნიკები, აღწერეთ თითოეული'''

# Control Flow განსაზღვრავს, რა თანმიმდევრობით უნდა შესრულდეს კოდი პროგრამაში.
# Sequencing (თანმიმდევრობა) კოდი სრულდება ზედიზედ, ხაზიდან ხაზამდე.
#Selection (არჩევანი) პროგრამა ირჩევს, რომელი კოდის ბლოკი უნდა შესრულდეს პირობის მიხედვით.
#Iteration (ციკლი) კოდი მეორდება მანამ, სანამ პირობა შესრულებულია.
# Control Flow არის პროგრამის ძირითადი მექანიზმი, რომელიც განსაზღვრავს, როგორ უნდა შესრულდეს კოდი. მისი ტექნიკები (Sequencing, Selection, Iteration) საშუალებას გვაძლევს, დავწეროთ ლოგიკური და ეფექტური პროგრამები.

